docs/artillery-basic.txt
Test run id: tfrqj_wqpdzdd53dcma3xhw7ymcmykdgb4r_d43q
Phase started: Carga baja (index: 0, duration: 30s) 03:09:42(-0500)

--------------------------------------
Metrics for period to: 03:09:50(-0500) (width: 6.053s)
--------------------------------------

http.codes.200: ................................................................ 14
http.downloaded_bytes: ......................................................... 1428
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 14
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 14
vusers.completed: .............................................................. 14
vusers.created: ................................................................ 14
vusers.created_by_name.Prueba basica HAProxy: .................................. 14
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.1
  max: ......................................................................... 11.6
  mean: ........................................................................ 5.3
  median: ...................................................................... 4.3
  p95: ......................................................................... 11.1
  p99: ......................................................................... 11.1


--------------------------------------
Metrics for period to: 03:10:00(-0500) (width: 9.053s)
--------------------------------------

http.codes.200: ................................................................ 20
http.downloaded_bytes: ......................................................... 2040
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 20
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Prueba basica HAProxy: .................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.1
  max: ......................................................................... 6.1
  mean: ........................................................................ 4.1
  median: ...................................................................... 3.8
  p95: ......................................................................... 5.2
  p99: ......................................................................... 5.2


Phase completed: Carga baja (index: 0, duration: 30s) 03:10:12(-0500)

--------------------------------------
Metrics for period to: 03:10:10(-0500) (width: 9.053s)
--------------------------------------

http.codes.200: ................................................................ 20
http.downloaded_bytes: ......................................................... 2040
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 20
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Prueba basica HAProxy: .................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 6.1
  mean: ........................................................................ 3.9
  median: ...................................................................... 3.6
  p95: ......................................................................... 5.2
  p99: ......................................................................... 5.2


--------------------------------------
Metrics for period to: 03:10:20(-0500) (width: 2.054s)
--------------------------------------

http.codes.200: ................................................................ 6
http.downloaded_bytes: ......................................................... 612
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 6
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 3
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 3
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 6
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 6
vusers.created_by_name.Prueba basica HAProxy: .................................. 6
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.1
  max: ......................................................................... 4.1
  mean: ........................................................................ 3.6
  median: ...................................................................... 3.4
  p95: ......................................................................... 3.8
  p99: ......................................................................... 3.8


All VUs finished. Total time: 30 seconds

--------------------------------
Summary report @ 03:10:14(-0500)
--------------------------------

http.codes.200: ................................................................ 60
http.downloaded_bytes: ......................................................... 6120
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 60
vusers.completed: .............................................................. 60
vusers.created: ................................................................ 60
vusers.created_by_name.Prueba basica HAProxy: .................................. 60
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 11.6
  mean: ........................................................................ 4.2
  median: ...................................................................... 3.8
  p95: ......................................................................... 6.1
  p99: ......................................................................... 11.1